Repository: MaxCSHan/SecretSanta
Catalog: src/locale/messages.*.xlf
Languages: fr, ja, th, zh

source: Secret Santa
fr: Générateur de
ja: シークレットサンタ
th: ซานต้าลับ
zh: 秘密聖誕老人

source: Generator
fr: Secret Santa
ja: ジェネレータ
zh: 產生器

source: Organize your Secret Santa using Email or Text Message.
ja: シークレットサンタパーティをメールで楽に作ろう
zh: 輕鬆用Email建立一個秘密交換禮物派對！

source: Name
fr: Votre nom
ja: お名前
th: ชื่อของคุณ
zh: 姓名

source: Email
ja: メール
th: อีเมล์
zh: 電子郵件信箱

source: Draw names with
fr: Tirez des noms avec
ja: 参加者
th: วาดชื่อด้วย
zh: 參加者

source: Next
fr: Étape Suivante
ja: 次
th: ขั้นตอนต่อไป
zh: 下一步

source: Group Name
fr: Nom du groupe
ja: グループネーム
th: ชื่อกลุ่ม
zh: 群組名稱

source: Date Of Exchange
fr: Date de l'échange de cadeaux
ja: 日程
th: วันที่แลกของขวัญ
zh: 交換日期

source: Choose the currency
fr: Unités Monétaires
ja: 貨幣を選んでください
th: หน่วยเงินตรา
zh: 選擇貨幣

source: Budget
ja: プレゼントの予算
th: งบประมาณ
zh: 禮物預算

source: Set up themes for gifts
fr: Choisissez des thèmes pour les cadeaux
ja: テーマを決めて、パーティは最も面白くなり
th: เลือกธีมสำหรับของขวัญ
zh: 選定送禮主題，讓派對更有趣！

source: Invitation Message
fr: Message
ja: 招待メッセージ
th: ข้อความ
zh: 邀請訊息

source: Submit
fr: Confirmez
ja: 申し出る
th: ยืนยัน
zh: 送出

source: Sign in with your Google Account
fr: Se connectez à un compte Google
ja: Googleアカウントでログイン
th: ลงชื่อเข้าใช้ด้วย Google
zh: 使用Google帳號登入

source: Hello, {{ LoginService.userData.displayName }}!
fr: Bonjour, {{ LoginService.userData.displayName }}！
ja: こんにちわ、 {{ LoginService.userData.displayName }}！
zh: 嗨, {{ LoginService.userData.displayName }}！

source: Logout
fr: Se déconnectez
ja: ログアウト
th: ออกจากระบบ
zh: 登出

source: Fill out your name
fr: Entrez des noms
ja: お名前を入力してください
th: ป้อนชื่อ
zh: 填入你的姓名

source: Enter Member {{ i + 2 }}
fr: Entrez Participant {{ i + 2 }}
ja: メンバー{{ i + 2 }}のお名前
th: ป้อนผู้เข้าร่วม {{ i + 2 }}
zh: 輸入成員姓名 {{ i + 2 }}

source: Enter Member {{ i + 2 }}'s Email
fr: Entrez Email de Participant {{ i + 2 }}
ja: メンバー{{ i + 2 }}のメール
th: ป้อนอีเมลผู้เข้าร่วม {{ i + 2 }}
zh: 輸入成員信箱 {{ i + 2 }}

source: Set your exclusions
fr: Déterminez vos exclusions
ja: 排除リストの設定
th: กำหนดการยกเว้นของคุณ
zh: 設定排除名單

source: Any exlcusion?
fr: Une exclusion indique qui ne doit pas tirer qui.
ja: 誰かと誰かのプレゼント交換を排除する？
zh: 有誰跟誰不能互抽禮物嗎？

source: Choose the member
fr: Choisissez les membres
ja: メンバーを選んでください
zh: 選擇成員

source: There are too few people for exclusions.
fr: Votre groupe est trop petit pour des exclusions.
ja: 人数が足りないので、リストの設置はできない
th: กลุ่มของคุณมีขนาดเล็กเกินไปสำหรับการยกเว้น
zh: 成員人數不夠多，無法建立排除名單

source: Send out the invitations!
fr: Envoyez vos invitations!
ja: 招待状を送る！
th: ส่งคำเชิญของคุณ!
zh: 送出邀請函！

source: A name is required
fr: Un nom est obligatoire
ja: お名前を入力してください
zh: 請填入姓名

source: Not a valid Email format
fr: Le format de email n'est pas valide
ja: 無効なメールアドレス
zh: 信箱不符合格式

source: Let's pick a date!
fr: Choisissez un date!
ja: 良い日々を選んでください！
zh: 選個日子吧！

source: Set a budget!
fr: Seletionnez budget
ja: 予算を決めてください
zh: 設定個預算吧！

source: Leave a message!
fr: Laissez un message!
ja: メッセージを残して！
zh: 留言給其他人吧！

source: Set up gift exchange details
fr: Détails pour l'échange de cadeaux
ja: シークレットサンタの内容について
th: รายละเอียดการแลกของขวัญ
zh: 設定交換禮物細節

source: A group name is required
fr: Un nom du groupe est obligatoire
ja: グループネームを入力してください
zh: 請輸入群組名稱

source: Secret Santa Generator
fr: Générateur de Secret Santa
ja: シークレットサンタジェネレータ
th: ซานต้าลับ
zh: 秘密聖誕老人產生器

source: My Account
fr: Mon Compte
ja: マイアカウント
zh: 我的帳號

source: My groups
fr: Mes groupes
ja: マイグループ
zh: 我的群組

source: Go to Page
fr: Allez à la page
ja: グループページに向かう
th: ไปที่หน้า
zh: 前往群組頁面

source: Member List
fr: Liste des membres
ja: メンバーリスト
th: รายชื่อสมาชิก
zh: 成員名單

source: My drawn name
fr: Nom tiré au sort
ja: 私のみくじ
zh: 我抽到的名字

source: Date of the gift exchange
fr: Date de l'échange de cadeaux
ja: プレゼント交換の日期
th: วันที่แลกของขวัญ
zh: 交換禮物日期

source: Ideas for the gift exchange
fr: Idées pour l’échange de cadeau
ja: プレゼントのテーマ
th: แนวคิดสำหรับการแลกเปลี่ยนของขวัญ
zh: 交換禮物主題

source: Send a message to the group
fr: Envoyez un message au groupe
ja: グループのお知らせ
th: ส่งข้อความไปยังกลุ่ม
zh: 群組通知

source: People haven't viewed their drawn names yet
fr: Tous les lots n’ont pas été vus
ja: まだ結果を見ていないメンバーがいる、彼たちにリマインドしよう

source: hasn't check the drawn name yet!
fr: Ces personnes n’ont pas encore vu le lot. Demandez à voir le lot.
ja: はまだ結果を見ていない
th: แม็กซ์เฉิน,คนเหล่านี้ยังไม่เห็นจำนวนมาก ขอดูล็อต.

source: It's time to show the results!
fr: Il est temps de montrer les résultats!
ja: 時間です、プレゼント交換の結果を発表しょう！
th: ได้เวลาแสดงผล!

source: It's {{ data.details.dateOfExchange.toDate() | date }}
fr: C'est {{ data.details.dateOfExchange.toDate() | date }}
ja: 現在の時刻は{{ data.details.dateOfExchange.toDate() | date }}
th: วันที่ {{ data.details.dateOfExchange.toDate() | date }}

source: Party Time🎉
ja: パーティタイムだ🎉

source: From the host
fr: Message de l'organisateur/trice
ja: 主催者からのメッセージ
th: ข้อความจากผู้จัดงาน

source: Organizer<mat-icon color="primary">stars</mat-icon>
fr: L'organisateur/trice<mat-icon color="primary">stars</mat-icon>
ja: 主催者<mat-icon color="primary">stars</mat-icon>
th: ผู้จัดทำ<mat-icon color="primary">stars</mat-icon>

source: Welcome to {{ data.details.groupName }}
fr: Bienvenue en {{ data.details.groupName }}
ja: {{ data.details.groupName }}にようこそ！
th: ยินดีต้อนรับสู่ {{ data.details.groupName }}

source: Go check the results!
fr: Vérifiez les résultats !
ja: 個人のみくじ結果をチェックする
th: ตรวจสอบผล!

source: Who would you like to re-send the drawn name notification email to?
fr: Entrez ou Changez vos email
ja: 個人メールの入力や変更
th: ป้อนหรือเปลี่ยนอีเมลของคุณ

source: Send
fr: Confirmez
ja: 送出
th: ยืนยัน

source: Change my email
fr: Changez mon email
ja: メールを変更する
th: เปลี่ยนอีเมลของฉัน

source: Sign in with your Google Account
fr: Se connectez à un compte Google
ja: Googleアカウントでログイン
th: ลงชื่อเข้าใช้ด้วย Google

source: Hello, {{ loginService.userData.displayName }}!
fr: Bonjour, {{ loginService.userData.displayName }}!
ja: こんにちは、 {{ loginService.userData.displayName }}!
th: สวัสดี,{{ loginService.userData.displayName }}!

source: Add to calendar
fr: Ajouter au calendrier
ja: カレンダーに添加する
th: เพิ่มในปฏิทิน

source: Draw the names now
ja: みくじを引きはじめる

source: Wait for the organizer to draw the names
fr: Attendez pour l'organisateur/trice tire des noms au sort
ja: みくじはまだ引きていない、主催者を待ってください

source: Organize your Secret Santa using Email.
fr: Faites rapidement un tirage au sort par email.

source: Party Time🎉
fr: Faisons la fête🎉
th: ปาร์ตี้กันเถอะ🎉

source: Organize your Secret Santa using Email.
th: จับฉลากได้อย่างรวดเร็วทางอีเมลหรือข้อความ

source: Choose a member
th: เลือกสมาชิก
